PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
    char saved_client_id[32] = {0};
    char saved_panel_id[32] = {0};
    
    if (config_manager_get_str("client_id", saved_client_id, sizeof(saved_client_id)) != ESP_OK ||
        config_manager_get_str("panel_id", saved_panel_id, sizeof(saved_panel_id)) != ESP_OK ||
        strlen(saved_client_id) == 0 || strlen(saved_panel_id) == 0) {
        LOG_I(TAG, "No saved panel config found, skipping panel subscriptions");
        return ESP_ERR_NOT_FOUND;
    }
    
    mqtt_manager_set_panel_config(saved_client_id, saved_panel_id);
    
    char topic[MQTT_TOPIC_MAX_LENGTH];
    
    esp_err_t ret = mqtt_manager_get_panel_topic(topic, sizeof(topic), "relay_config");
    if (ret == ESP_OK) {
        mqtt_manager_subscribe(topic, 2);
        LOG_I(TAG, "Subscribed to panel relay_config: %s", topic);
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    
    ret = mqtt_manager_get_panel_topic(topic, sizeof(topic), "relays");
    if (ret == ESP_OK) {
        mqtt_manager_subscribe(topic, 2);
        LOG_I(TAG, "Subscribed to panel relays: %s", topic);
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    
    ret = mqtt_manager_get_panel_topic(topic, sizeof(topic), "command");
    if (ret == ESP_OK) {
        mqtt_manager_subscribe(topic, 1);
        LOG_I(TAG, "Subscribed to panel command: %s", topic);
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    
    ret = mqtt_manager_get_panel_topic(topic, sizeof(topic), "status");
    if (ret == ESP_OK) {
        mqtt_manager_subscribe(topic, 1);
        LOG_I(TAG, "Subscribed to panel status: %s", topic);
    }
    
    return ESP_OK;
}

esp_err_t mqtt_manager_cleanup_panel_subscriptions(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (!mqtt_manager_is_connected()) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (strlen(ctx->client_panel_id) == 0 || strlen(ctx->panel_id) == 0) {
        return ESP_OK;
    }
    
    char topic[MQTT_TOPIC_MAX_LENGTH];
    
    esp_err_t ret = mqtt_manager_get_panel_topic(topic, sizeof(topic), "relay_config");
    if (ret == ESP_OK) {
        mqtt_manager_unsubscribe(topic);
        LOG_I(TAG, "Unsubscribed from panel relay_config: %s", topic);
    }
    
    ret = mqtt_manager_get_panel_topic(topic, sizeof(topic), "relays");
    if (ret == ESP_OK) {
        mqtt_manager_unsubscribe(topic);
        LOG_I(TAG, "Unsubscribed from panel relays: %s", topic);
    }
    
    ret = mqtt_manager_get_panel_topic(topic, sizeof(topic), "command");
    if (ret == ESP_OK) {
        mqtt_manager_unsubscribe(topic);
        LOG_I(TAG, "Unsubscribed from panel command: %s", topic);
    }
    
    ret = mqtt_manager_get_panel_topic(topic, sizeof(topic), "status");
    if (ret == ESP_OK) {
        mqtt_manager_unsubscribe(topic);
        LOG_I(TAG, "Unsubscribed from panel status: %s", topic);
    }
    
    return ESP_OK;
}

static void mqtt_event_handler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data) {
    esp_mqtt_event_handle_t event = (esp_mqtt_event_handle_t)event_data;
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    int64_t current_time = esp_timer_get_time() / 1000;
    ctx->last_activity_time = current_time;
    
    switch (event->event_id) {
        case MQTT_EVENT_CONNECTED:
            LOG_I(TAG, "MQTT connected");
            
            if (xSemaphoreTake(ctx->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                ctx->state = MQTT_MANAGER_STATE_CONNECTED;
                ctx->was_connected = true;
                ctx->reconnect_attempts = 0;
                xSemaphoreGive(ctx->mutex);
            }
            
            safe_mqtt_clear_bits(ctx, MQTT_DISCONNECTED_BIT | MQTT_ERROR_BIT);
            safe_mqtt_set_bits(ctx, MQTT_CONNECTED_BIT);
            
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->state_user_data);
            }
            
            if (strlen(ctx->esp32_id) > 0) {
                snprintf(ctx->config_topic, sizeof(ctx->config_topic), "esp32/config/%s", ctx->esp32_id);
                mqtt_manager_subscribe(ctx->config_topic, 2);
                
                char notify_topic[MQTT_TOPIC_MAX_LENGTH];
                snprintf(notify_topic, sizeof(notify_topic), "esp32/notify/%s/deleted", ctx->esp32_id);
                mqtt_manager_subscribe(notify_topic, 2);
                
                mqtt_manager_setup_panel_subscriptions();
            }
            
            mqtt_pending_message_t pending_msg;
            int pending_count = 0;
            while (xQueueReceive(ctx->pending_messages, &pending_msg, 0) == pdTRUE && pending_count < 10) {
                esp_mqtt_client_publish(event->client, pending_msg.topic, pending_msg.data, 
                                        pending_msg.data_len, pending_msg.qos, pending_msg.retain);
                pending_count++;
                vTaskDelay(pdMS_TO_TICKS(50));
            }
            break;
            
        case MQTT_EVENT_DISCONNECTED:
            LOG_W(TAG, "MQTT disconnected");
            
            if (xSemaphoreTake(ctx->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                ctx->state = MQTT_MANAGER_STATE_RECONNECTING;
                ctx->reconnect_attempts++;
                xSemaphoreGive(ctx->mutex);
            }
            
            safe_mqtt_clear_bits(ctx, MQTT_CONNECTED_BIT);
            safe_mqtt_set_bits(ctx, MQTT_DISCONNECTED_BIT);
            
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->state_user_data);
            }
            break;
            
        case MQTT_EVENT_SUBSCRIBED:
            LOG_I(TAG, "MQTT subscribed, msg_id=%d", event->msg_id);
            break;
            
        case MQTT_EVENT_PUBLISHED:
            break;
            
        case MQTT_EVENT_DATA:
            if (ctx->message_callback && 
                event->topic_len > 0 && event->topic_len < MAX_TOPIC_LENGTH &&
                event->data_len > 0 && event->data_len < MAX_MESSAGE_LENGTH) {
                
                if (!should_process_message(current_time)) {
                    LOG_D(TAG, "Message rate limited, skipping");
                    break;
                }
                
