PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
                char *topic_buffer = mqtt_get_buffer(ctx);
                char *message_buffer = mqtt_get_buffer(ctx);
                
                if (topic_buffer && message_buffer) {
                    memcpy(topic_buffer, event->topic, event->topic_len);
                    topic_buffer[event->topic_len] = '\0';
                    
                    memcpy(message_buffer, event->data, event->data_len);
                    message_buffer[event->data_len] = '\0';
                    
                    ctx->message_callback(topic_buffer, message_buffer, event->data_len, ctx->message_user_data);
                    
                    mqtt_release_buffer(ctx, topic_buffer);
                    mqtt_release_buffer(ctx, message_buffer);
                } else {
                    if (topic_buffer) mqtt_release_buffer(ctx, topic_buffer);
                    if (message_buffer) mqtt_release_buffer(ctx, message_buffer);
                }
            }
            break;
            
        case MQTT_EVENT_ERROR:
            LOG_E(TAG, "MQTT error");
            
            if (xSemaphoreTake(ctx->mutex, pdMS_TO_TICKS(50)) == pdTRUE) {
                ctx->state = MQTT_MANAGER_STATE_RECONNECTING;
                ctx->reconnect_attempts++;
                xSemaphoreGive(ctx->mutex);
            }
            
            safe_mqtt_clear_bits(ctx, MQTT_CONNECTED_BIT);
            safe_mqtt_set_bits(ctx, MQTT_ERROR_BIT);
            
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->state_user_data);
            }
            break;
            
        default:
            break;
    }
}

esp_err_t mqtt_manager_init(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group != NULL) {
        LOG_W(TAG, "Already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    LOG_I(TAG, "Initializing MQTT Manager");
    
    memset(ctx, 0, sizeof(mqtt_manager_context_t));
    
    ctx->state = MQTT_MANAGER_STATE_INIT;
    
    ctx->event_group = xEventGroupCreate();
    if (ctx->event_group == NULL) {
        LOG_E(TAG, "Failed to create event group");
        return ESP_ERR_NO_MEM;
    }
    
    ctx->mutex = xSemaphoreCreateMutex();
    if (ctx->mutex == NULL) {
        vEventGroupDelete(ctx->event_group);
        ctx->event_group = NULL;
        LOG_E(TAG, "Failed to create mutex");
        return ESP_ERR_NO_MEM;
    }
    
    ctx->buffer_mutex = xSemaphoreCreateMutex();
    if (ctx->buffer_mutex == NULL) {
        vSemaphoreDelete(ctx->mutex);
        vEventGroupDelete(ctx->event_group);
        ctx->mutex = NULL;
        ctx->event_group = NULL;
        LOG_E(TAG, "Failed to create buffer mutex");
        return ESP_ERR_NO_MEM;
    }
    
    for (int i = 0; i < 3; i++) {
        ctx->buffer_pool[i] = heap_caps_malloc(MAX_MESSAGE_LENGTH, MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
        if (ctx->buffer_pool[i] == NULL) {
            for (int j = 0; j < i; j++) {
                free(ctx->buffer_pool[j]);
                ctx->buffer_pool[j] = NULL;
            }
            vSemaphoreDelete(ctx->buffer_mutex);
            vSemaphoreDelete(ctx->mutex);
            vEventGroupDelete(ctx->event_group);
            return ESP_ERR_NO_MEM;
        }
        ctx->buffer_in_use[i] = false;
    }
    
    ctx->pending_messages = xQueueCreate(DEFAULT_MAX_QUEUE_SIZE, sizeof(mqtt_pending_message_t));
    if (ctx->pending_messages == NULL) {
        for (int i = 0; i < 3; i++) {
            free(ctx->buffer_pool[i]);
            ctx->buffer_pool[i] = NULL;
        }
        vSemaphoreDelete(ctx->buffer_mutex);
        vSemaphoreDelete(ctx->mutex);
        vEventGroupDelete(ctx->event_group);
        ctx->mutex = NULL;
        ctx->event_group = NULL;
        LOG_E(TAG, "Failed to create message queue");
        return ESP_ERR_NO_MEM;
    }
    
    strncpy(ctx->broker_url, DEFAULT_BROKER, sizeof(ctx->broker_url) - 1);
    ctx->broker_url[sizeof(ctx->broker_url) - 1] = '\0';
    ctx->port = DEFAULT_PORT;
    ctx->use_ssl = true;
    ctx->lwt_qos = 1;
    ctx->lwt_retain = false;
    
    ctx->state = MQTT_MANAGER_STATE_DISCONNECTED;
    safe_mqtt_set_bits(ctx, MQTT_DISCONNECTED_BIT);
    
    LOG_I(TAG, "MQTT Manager initialized");
    return ESP_OK;
}

esp_err_t mqtt_manager_set_esp32_id(const char *esp32_id) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        LOG_E(TAG, "Not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    esp_err_t validation_result = validate_esp32_id(esp32_id);
    if (validation_result != ESP_OK) {
        return validation_result;
    }
    
    LOG_I(TAG, "Setting credentials for ESP32 ID: %s", esp32_id);
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        strncpy(ctx->esp32_id, esp32_id, sizeof(ctx->esp32_id) - 1);
        ctx->esp32_id[sizeof(ctx->esp32_id) - 1] = '\0';
        
        esp32_id_manager_get_mac(ctx->mac_address, sizeof(ctx->mac_address));
        
        strncpy(ctx->client_id, esp32_id, sizeof(ctx->client_id) - 1);
        ctx->client_id[sizeof(ctx->client_id) - 1] = '\0';
        
        strncpy(ctx->username, esp32_id, sizeof(ctx->username) - 1);
        ctx->username[sizeof(ctx->username) - 1] = '\0';
        
        strncpy(ctx->password, esp32_id, sizeof(ctx->password) - 1);
        ctx->password[sizeof(ctx->password) - 1] = '\0';
        
        snprintf(ctx->lwt_topic, sizeof(ctx->lwt_topic), "system/status/%s", esp32_id);
        
        char timestamp_str[20];
        if (time_manager_is_synchronized()) {
            time_manager_get_timestamp(timestamp_str, sizeof(timestamp_str));
        } else {
            snprintf(timestamp_str, sizeof(timestamp_str), "%lld", (long long)(esp_timer_get_time() / 1000));
        }
        
        snprintf(ctx->lwt_message, sizeof(ctx->lwt_message),
                "{\"esp32_id\":\"%.8s\",\"status\":\"OFFLINE\",\"timestamp\":%.15s,\"type\":\"lwt\"}",
                esp32_id, timestamp_str);
        
        xSemaphoreGive(ctx->mutex);
    }
    
    LOG_I(TAG, "Credentials configured");
    return ESP_OK;
}

