PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
esp_err_t mqtt_manager_connect(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    char temp_buffer[MQTT_BROKER_MAX_LENGTH + 32];
    
    if (ctx->event_group == NULL) {
        LOG_E(TAG, "Not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (strlen(ctx->esp32_id) == 0) {
        LOG_E(TAG, "ESP32 ID not set");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (mqtt_manager_is_connected() || ctx->state == MQTT_MANAGER_STATE_CONNECTING) {
        LOG_W(TAG, "Already connected or connecting");
        return ESP_OK;
    }
    
    if (!wifi_manager_is_connected()) {
        LOG_E(TAG, "WiFi not connected");
        return ESP_ERR_INVALID_STATE;
    }
    
    LOG_I(TAG, "Connecting to MQTT broker");
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        ctx->state = MQTT_MANAGER_STATE_CONNECTING;
        safe_mqtt_clear_bits(ctx, MQTT_CONNECTED_BIT | MQTT_ERROR_BIT);
        
        if (ctx->client != NULL) {
            esp_mqtt_client_unregister_event(ctx->client, ESP_EVENT_ANY_ID, mqtt_event_handler);
            esp_err_t stop_ret = esp_mqtt_client_stop(ctx->client);
            if (stop_ret == ESP_OK) {
                vTaskDelay(pdMS_TO_TICKS(1000));
            }
            esp_mqtt_client_destroy(ctx->client);
            ctx->client = NULL;
            vTaskDelay(pdMS_TO_TICKS(500));
        }
        
        char cleaned_broker[MQTT_BROKER_MAX_LENGTH];
        strncpy(cleaned_broker, ctx->broker_url, sizeof(cleaned_broker) - 1);
        cleaned_broker[sizeof(cleaned_broker) - 1] = '\0';
        
        char *clean_start = cleaned_broker;
        while (*clean_start && (*clean_start == ':' || *clean_start == '/' || *clean_start <= ' ')) {
            clean_start++;
        }
        
        if (strlen(clean_start) == 0) {
            LOG_E(TAG, "Broker URL is empty");
            ctx->state = MQTT_MANAGER_STATE_ERROR;
            safe_mqtt_set_bits(ctx, MQTT_ERROR_BIT);
            xSemaphoreGive(ctx->mutex);
            return ESP_ERR_INVALID_ARG;
        }
        
        struct addrinfo hints, *result;
        memset(&hints, 0, sizeof(hints));
        hints.ai_family = AF_INET;
        hints.ai_socktype = SOCK_STREAM;
        
        LOG_I(TAG, "Testing DNS resolution for: %s", clean_start);
        int dns_result = getaddrinfo(clean_start, NULL, &hints, &result);
        if (dns_result != 0) {
            LOG_E(TAG, "DNS resolution failed for %s", clean_start);
            ctx->state = MQTT_MANAGER_STATE_ERROR;
            safe_mqtt_set_bits(ctx, MQTT_ERROR_BIT);
            xSemaphoreGive(ctx->mutex);
            return ESP_FAIL;
        } else {
            LOG_I(TAG, "DNS resolution successful for %s", clean_start);
            freeaddrinfo(result);
        }
        
        snprintf(temp_buffer, sizeof(temp_buffer), "%s://%s:%d", 
                ctx->use_ssl ? "mqtts" : "mqtt", clean_start, ctx->port);
        
        LOG_I(TAG, "Connecting to URI: %s", temp_buffer);
        
        esp_mqtt_client_config_t mqtt_cfg = {0};
        mqtt_cfg.broker.address.uri = temp_buffer;
        mqtt_cfg.credentials.client_id = ctx->client_id;
        mqtt_cfg.credentials.username = ctx->username;
        mqtt_cfg.credentials.authentication.password = ctx->password;
        mqtt_cfg.session.keepalive = 60;
        mqtt_cfg.session.disable_clean_session = false;
        mqtt_cfg.buffer.size = 1536;
        mqtt_cfg.buffer.out_size = 1536;

        mqtt_cfg.network.timeout_ms = 15000;
        mqtt_cfg.network.reconnect_timeout_ms = 10000;
        mqtt_cfg.task.stack_size = 16384;
        
        if (time_manager_is_synchronized()) {
            char timestamp_str[20];
            time_manager_get_timestamp(timestamp_str, sizeof(timestamp_str));
            snprintf(ctx->lwt_message, sizeof(ctx->lwt_message),
                    "{\"esp32_id\":\"%s\",\"status\":\"OFFLINE\",\"timestamp\":%s,\"type\":\"lwt\"}",
                    ctx->esp32_id, timestamp_str);
        }
        
        mqtt_cfg.session.last_will.topic = ctx->lwt_topic;
        mqtt_cfg.session.last_will.msg = ctx->lwt_message;
        mqtt_cfg.session.last_will.msg_len = strlen(ctx->lwt_message);
        mqtt_cfg.session.last_will.qos = ctx->lwt_qos;
        mqtt_cfg.session.last_will.retain = ctx->lwt_retain;
        
        if (ctx->use_ssl) {
            esp_err_t ssl_ret = mqtt_ssl_setup_minimal_config(&mqtt_cfg);
            if (ssl_ret != ESP_OK) {
                ctx->state = MQTT_MANAGER_STATE_ERROR;
                safe_mqtt_set_bits(ctx, MQTT_ERROR_BIT);
                xSemaphoreGive(ctx->mutex);
                LOG_E(TAG, "SSL config failed");
                return ssl_ret;
            }
        }
        
        ctx->client = esp_mqtt_client_init(&mqtt_cfg);
        if (ctx->client == NULL) {
            ctx->state = MQTT_MANAGER_STATE_ERROR;
            safe_mqtt_set_bits(ctx, MQTT_ERROR_BIT);
            xSemaphoreGive(ctx->mutex);
            LOG_E(TAG, "Failed to create MQTT client");
            return ESP_FAIL;
        }
        
        esp_mqtt_client_register_event(ctx->client, ESP_EVENT_ANY_ID, mqtt_event_handler, NULL);
        
        esp_err_t ret = esp_mqtt_client_start(ctx->client);
        if (ret != ESP_OK) {
            LOG_E(TAG, "Failed to start MQTT client");
            esp_mqtt_client_destroy(ctx->client);
            ctx->client = NULL;
            ctx->state = MQTT_MANAGER_STATE_ERROR;
            safe_mqtt_set_bits(ctx, MQTT_ERROR_BIT);
            xSemaphoreGive(ctx->mutex);
            return ret;
        }
        
        xSemaphoreGive(ctx->mutex);
    }
    
    if (ctx->state_callback) {
        ctx->state_callback(ctx->state, ctx->state_user_data);
    }
    
    EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                          MQTT_CONNECTED_BIT | MQTT_ERROR_BIT,
                                          pdFALSE, pdFALSE, pdMS_TO_TICKS(60000));
    
    if (bits & MQTT_CONNECTED_BIT) {
        LOG_I(TAG, "MQTT connected successfully");
        return ESP_OK;
    } else if (bits & MQTT_ERROR_BIT) {
        LOG_E(TAG, "MQTT connection error");
        return ESP_FAIL;
    } else {
        LOG_W(TAG, "MQTT connection timeout");
        return ESP_ERR_TIMEOUT;
    }
}

esp_err_t mqtt_manager_disconnect(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ctx->client == NULL) {
        return ESP_OK;
    }
    
