PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
    LOG_I(TAG, "Disconnecting from MQTT");
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        esp_err_t ret = esp_mqtt_client_stop(ctx->client);
        if (ret != ESP_OK) {
            xSemaphoreGive(ctx->mutex);
            return ret;
        }
        
        ctx->state = MQTT_MANAGER_STATE_DISCONNECTED;
        ctx->was_connected = false;
        safe_mqtt_clear_bits(ctx, MQTT_CONNECTED_BIT | MQTT_ERROR_BIT);
        safe_mqtt_set_bits(ctx, MQTT_DISCONNECTED_BIT);
        
        xSemaphoreGive(ctx->mutex);
    }
    
    if (ctx->state_callback) {
        ctx->state_callback(ctx->state, ctx->state_user_data);
    }
    
    return ESP_OK;
}

bool mqtt_manager_is_connected(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return false;
    }
    
    EventBits_t bits = xEventGroupGetBits(ctx->event_group);
    return (bits & MQTT_CONNECTED_BIT) != 0;
}

esp_err_t mqtt_manager_subscribe(const char *topic, int qos) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL || ctx->client == NULL || topic == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (qos < 0 || qos > 2) {
        qos = 1;
    }
    
    int msg_id = esp_mqtt_client_subscribe(ctx->client, topic, qos);
    return (msg_id < 0) ? ESP_FAIL : ESP_OK;
}

esp_err_t mqtt_manager_unsubscribe(const char *topic) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL || ctx->client == NULL || topic == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    int msg_id = esp_mqtt_client_unsubscribe(ctx->client, topic);
    return (msg_id < 0) ? ESP_FAIL : ESP_OK;
}

esp_err_t mqtt_manager_publish(const char *topic, const char *data, int data_len, int qos, bool retain) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL || topic == NULL || data == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    
    if (data_len < 0) {
        data_len = strlen(data);
    }
    
    if (data_len > DEFAULT_BUFFER_SIZE) {
        LOG_E(TAG, "Message too large: %d bytes (max %d)", data_len, DEFAULT_BUFFER_SIZE);
        return ESP_ERR_INVALID_SIZE;
    }
    
    if (qos < 0 || qos > 2) {
        qos = 1;
    }
    
    if (!mqtt_manager_is_connected()) {
        mqtt_pending_message_t pending_msg;
        size_t topic_len = strlen(topic);
        if (topic_len >= sizeof(pending_msg.topic)) {
            LOG_E(TAG, "Topic too long: %zu", topic_len);
            return ESP_ERR_INVALID_SIZE;
        }
        
        strncpy(pending_msg.topic, topic, sizeof(pending_msg.topic) - 1);
        pending_msg.topic[sizeof(pending_msg.topic) - 1] = '\0';
        
        if (data_len > sizeof(pending_msg.data) - 1) {
            data_len = sizeof(pending_msg.data) - 1;
        }
        memcpy(pending_msg.data, data, data_len);
        pending_msg.data[data_len] = '\0';
        
        pending_msg.data_len = data_len;
        pending_msg.qos = qos;
        pending_msg.retain = retain;
        
        if (xQueueSend(ctx->pending_messages, &pending_msg, 0) != pdTRUE) {
            mqtt_pending_message_t dummy;
            if (xQueueReceive(ctx->pending_messages, &dummy, 0) == pdTRUE) {
                if (xQueueSend(ctx->pending_messages, &pending_msg, 0) != pdTRUE) {
                    LOG_E(TAG, "Message queue full, dropping message");
                    return ESP_ERR_NO_MEM;
                }
            }
        }
        return ESP_OK;
    }
    
    int msg_id = esp_mqtt_client_publish(ctx->client, topic, data, data_len, qos, retain);
    if (msg_id < 0) {
        LOG_E(TAG, "Failed to publish to: %s", topic);
        return ESP_FAIL;
    }
    
    ctx->last_activity_time = esp_timer_get_time() / 1000;
    return ESP_OK;
}

esp_err_t mqtt_manager_publish_json(const char *topic, const char *json_data, int qos, bool retain) {
    if (topic == NULL || json_data == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    
    return mqtt_manager_publish(topic, json_data, strlen(json_data), qos, retain);
}

esp_err_t mqtt_manager_loop(int timeout_ms) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    int64_t current_time = esp_timer_get_time() / 1000;
    
    if (ctx->state == MQTT_MANAGER_STATE_RECONNECTING && 
        (current_time - ctx->last_reconnect_time > 30000)) {
        
        ctx->last_reconnect_time = current_time;
        
        if (wifi_manager_is_connected()) {
            LOG_I(TAG, "MQTT reconnect attempt %d (infinite retries enabled)", ctx->reconnect_attempts);
            mqtt_manager_connect();
        }
    }
    
    if (wifi_manager_is_connected() && 
        !mqtt_manager_is_connected() && 
        ctx->state != MQTT_MANAGER_STATE_CONNECTING && 
        ctx->state != MQTT_MANAGER_STATE_RECONNECTING) {
        
        if (current_time - ctx->last_reconnect_time > 30000) {
            ctx->last_reconnect_time = current_time;
            mqtt_manager_connect();
        }
    }
    
    return ESP_OK;
}

esp_err_t mqtt_manager_set_message_callback(mqtt_manager_message_callback_t callback, void *user_data) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        ctx->message_callback = callback;
        ctx->message_user_data = user_data;
        xSemaphoreGive(ctx->mutex);
    }
    
    return ESP_OK;
}

esp_err_t mqtt_manager_set_state_callback(mqtt_manager_state_callback_t callback, void *user_data) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        ctx->state_callback = callback;
        ctx->state_user_data = user_data;
        xSemaphoreGive(ctx->mutex);
    }
    
    return ESP_OK;
}

mqtt_manager_state_t mqtt_manager_get_state(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return MQTT_MANAGER_STATE_INIT;
    }
    
    return ctx->state;
}

